FV2304/E_0065.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
MaBiS

7.47.1: AD: Übermittlung Prüfmitteilung des Deltazeitreihenübertrags von NB über BIKO an ÜNB



end title
:<b>E_0065</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>1: </b> Liegt die Version der Zeitreihe des MaBiS-ZP für diesen Bilanzierungsmonat bereits vor?) then (ja)
    :A01;
    note left
        Cluster: Abweisung
        Zeitreihe bereits vorhanden
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Ist für die Version der Zeitreihe des DZÜ für den Bilanzierungsmonat eine DZÜ-Liste mit identischer Version und identischem Bilanzierungsmonat zu diesem MaBiS-ZP vorhanden?) then (ja)
else (nein)
    :A02;
    note left
        Cluster: Ablehnung
        DZÜ-Liste nicht vorhanden
    endnote
    kill;
endif
if (<b>3: </b> Entsprechen die Energiemengen des DZÜ den auf Basis des Prüfergebnisses der DZÜ-Liste ermittelten Energiemengen?) then (ja)
    :A04;
    note left
        Cluster: Zustimmung
        Zeitreihe akzeptiert
    endnote
    kill;
else (nein)
    :A03;
    note left
        Cluster: Ablehnung
        Energiemenge falsch / nicht plausibel
    endnote
    kill;
endif

@enduml
